### 1. DataFrame
        - dataframe은 인덱싱할때 열.행순

In [3]:
import numpy as np
import pandas as pd

- 생성 방법1: 2차원 데이터, 컬럼명,인덱스

In [6]:
df1 = pd.DataFrame(
    np.random.randint(40, 101, 12).reshape(4,3), # 2차원 데이터
    columns=list('XYZ'),    # 컬럼명 list로 줘야함
    index=list('abcd')      # 인덱스명
)
df1 # series(열)data 자료형이 일치해야한다.

    X   Y   Z
a  44  65  87
b  43  70  62
c  58  49  43
d  43  96  46

- 생성 방법2: 딕셔너리의 리스트 /크롤링할때 가장좋은 방법

In [3]:
data = [
    {'X':65, 'Y':82, 'Z':95},
    {'X':84, 'Y':86, 'Z':98},
    {'X':60, 'Y':95, 'Z':50},
    {'X':97, 'Y':69, 'Z':54},
]
df2 = pd.DataFrame(data, index=list('abcd'))
df2 # series에서는x,y,z가 인덱스가된다.

    X   Y   Z
a  65  82  95
b  84  86  98
c  60  95  50
d  97  69  54

- 생성 방법3: 데이터가 value, 컬럼명이 key가 되는 딕셔너리 /데이터를 만든때 좋은방법

In [4]:
data = {
    'X':[85,70,40,73],
    'Y':[80,100,58,98],
    'Z':[90,81,98,94]
}
df3 = pd.DataFrame(data, index=list('abcd'))
df3

    X    Y   Z
a  85   80  90
b  70  100  81
c  40   58  98
d  73   98  94

In [5]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],   # 정수
    "지역": ["수도권", "경상권", "수도권", "경상권"], # 문자열 열의 data type이같음
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141] # 실수
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [6]:
# .values로 data만 가져오기
df.values # numpy array로 끄집어옴 / data type이 object인데 출력값에서 수도권 한줄만 보면 문자열,정수,실수 모두 있어서 다 받는 object이다.
# /colum식으로 받아오면 dtype이 다를수있다.

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [7]:
# columns만 가져오기
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [8]:
# index만 가져오기
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [9]:
df.index.name = '도시' # 인덱스이름 추가
df.columns.name = '항목' # 컬럼 이름 추가
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [10]:
''' 연습문제4.1.2
다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.'''

' 연습문제4.1.2\n다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.\n(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.\n(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.'

In [11]:
chr(65) + chr(90) # 문자열도 랜덤하게 사용할수있다.

'AZ'

In [12]:
col_A, col_B, col_C, col_D, col_E = [],[],[],[],[]
np.random.seed = 2023
for i in range(5):
    col_A.append(chr(np.random.randint(65, 91)) + chr(np.random.randint(65, 91))) # 2글자로 만들려고 더함
    col_B.append(np.random.randint(1,7))
    col_C.append(np.random.randint(40, 101))
    col_D.append(np.random.randint(1, 100) * 1000)
    col_E.append(np.round(np.random.rand(), 4)) #소수점 넷째자리까지 랜덤
    
df4 = pd.DataFrame(
    {'col_A':col_A, 'col_B':col_B, 'col_C':col_C, 'col_D':col_D, 'col_E':col_E} # {'컬럼이름':data}
) 
df4

  col_A  col_B  col_C  col_D   col_E
0    CA      3     87  27000  0.7512
1    SG      1     49  40000  0.2790
2    QX      6     73  23000  0.7429
3    WZ      5     93  46000  0.9245
4    KG      2     84  10000  0.6685

In [13]:
# list안에 dict
data = []
for i in range(5):
    dd = {
        'col_A':(chr(np.random.randint(65, 91)) + chr(np.random.randint(65, 91))),
        'col_B':(np.random.randint(1,7)),
        'col_C':(np.random.randint(40, 101)),
        'col_D':(np.random.randint(1, 100) * 1000),
        'col_E':(np.round(np.random.rand(), 4))
    }
    data.append(dd)

df5= pd.DataFrame(data)
df5

  col_A  col_B  col_C  col_D   col_E
0    PP      6     62  53000  0.5053
1    MI      1     49  41000  0.4964
2    ZB      5     50  35000  0.4720
3    DD      3     43  36000  0.2539
4    PH      3     86  10000  0.4551

- 전치(Transpose)

In [14]:
df1.T

    a   b   c   d
X  93  50  94  86
Y  97  71  61  82
Z  56  59  66  71

In [15]:
df5.T # colum의 data type은 같아야함 그래서 dtype이 object (다다른게 포함되어있음) 이러면 걍 다 달라도 되는것같음..어차피 object인거아닌가

            0       1      2       3       4
col_A      PP      MI     ZB      DD      PH
col_B       6       1      5       3       3
col_C      62      49     50      43      86
col_D   53000   41000  35000   36000   10000
col_E  0.5053  0.4964  0.472  0.2539  0.4551

- 열 데이터의 갱신, 추가, 삭제

In [16]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [17]:
# columns명 지정. 
# 컬럼 이거하나가 series. 열 이다. 
#  dataframe은 열이 먼저다 우선인 방식이다.
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [18]:
# 딕셔너리랑 같다고 생각하면된다. 
# 해당key가 없으면 쌍이 새로만들어지듯이 해당열이름이 없으면 열을 새로만들고 있으면 수정해준다
# 열 이름이 있으면 갱신, 없으면 생성
df['2005-2010 증가율'] = ((df['2010'] - df['2005']) / df['2005'] * 100).round(2)
df # round안하면 dataframe은 기본값이 소수점6자리

항목   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

- 제거

In [19]:
# 열 삭제
del df['2005-2010 증가율']
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

- 열 인덱싱

In [20]:
df['지역'] # 열이름(지역)하나만 선택하면 시리즈 반환

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [21]:
df[['2015','2010']] # 열 이름을 여러개 리스트로 주면, 데이터프레임 반환 /리스트안에리스트로 줘야 dataframe으로반환

항목     2015     2010
도시
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [22]:
df[['2015']] # dataframe으로 나온다.

항목     2015
도시
서울  9904312
부산  3448737
인천  2890451
대구  2466052

- 행 인덱싱하려면 전치를 하고 행을열로바꾸고 인덱싱하는게 좋은방법이라심
따라서 책에있지만 넘어감

- 개별 인덱싱

In [28]:
df["2015"]["서울"]

9904312

In [27]:
# 열 이름, 행 인덱스
df['지역']['서울'], df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권')

In [ ]:
# 컬럼명이 숫자이기 때문에 안됨(.으로 부르는거) / 스페이스 있어도 안됨
df['2015']['서울'] 
df.2105['서울']  # 숫자안됨

In [30]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [37]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [61]:
df[['국어','수학']] # 거리 떨어져있어도 되네

    국어  수학
춘향  80  90
몽룡  90  60
향단  70  80
방자  30  70

In [38]:
#  모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [42]:
#  모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']] # 리스트안에 줘야함

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [63]:
# 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다. 방법1
df['평균'] = ((df['국어'] + df['영어'] + df['수학']) / 3).round(1)
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  80  70  60.0

In [ ]:
# 평균 방법2
df['평균'] = ((df.국어+ df.영어 + df.수학) /3).round(1)

In [64]:
# 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df['영어']['방자'] # 열먼저 선택하고 그다음 행 선택하기
# df['영어']['방자'] = 80 하면 warnning masage 나오는데 덮어두기로함
# == 으로하면 masage안뜸

80

In [65]:
df['영어']['방자'] == 80
df['평균']= ((df['국어'] + df['영어'] + df['수학']) / 3).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [66]:
# 춘향의 점수를 데이터프레임으로 나타낸다.
df[0:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [67]:
df.T[['춘향']]

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [60]:
# 향단의 점수를 시리즈로 나타낸다.
df.T['향단'] # 리스트를 한번만 쓰면 시리즈로 가져올수있나보다

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64